# NeedsSubSchemaGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder..::..NeedsSubSchemaGUID Method
FieldBuilder Class See Also
---
Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool NeedsSubSchemaGUID()
```

Visual Basic
---
```text
Public Function NeedsSubSchemaGUID As Boolean
```

Visual C++
---
```text
public:
bool NeedsSubSchemaGUID()
```

# ### Return Value
True if SubSchemaGUID is required.
# See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace